#+TITLE: Emacs Lisp Cheat Sheet
#+AUTHOR: Joshua Branson
#+LATEX_HEADER: \usepackage{lmodern}
#+LATEX_HEADER: \usepackage[QX]{fontenc}

*** float
Floats are for storing numbers that contain fractional parts.  They can be written with an explicit decimal part, or they can be written in scientific notation to be considered a float.

All of the following numbers represent 150.0.
#+BEGIN_SRC emacs-lisp
150.0
15e1
.15e3
1500e-1
#+END_SRC

#+RESULTS:
: 150.0

**** character
A character is a letter.  Internally elisp stores chars as an integer, so "R" has the value:

#+BEGIN_SRC emacs-lisp
?R
#+END_SRC

#+RESULTS:
: 82

You can also discover the syntax for the special characters.

#+BEGIN_SRC emacs-lisp
?\(
?\\
#+END_SRC

#+RESULTS:
: 92

#+BEGIN_SRC :exports code
  ?\a ⇒ 7                 ; control-g, ‘C-g’
  ?\b ⇒ 8                 ; backspace, <BS>, ‘C-h’
  ?\t ⇒ 9                 ; tab, <TAB>, ‘C-i’
  ?\n ⇒ 10                ; newline, ‘C-j’
  ?\v ⇒ 11                ; vertical tab, ‘C-k’
  ?\f ⇒ 12                ; formfeed character, ‘C-l’
  ?\r ⇒ 13                ; carriage return, <RET>, ‘C-m’
  ?\e ⇒ 27                ; escape character, <ESC>, ‘C-[’
  ?\s ⇒ 32                ; space character, <SPC>
  ?\\ ⇒ 92                ; backslash character, ‘\’
  ?\d ⇒ 127               ; delete character, <DEL>
#+END_SRC

#+RESULTS:

*** associated lists
Associated lists are also alists is a lisp list, where each element is a cons cell.  So for example:

#+BEGIN_SRC emacs-lisp
  (setq fibanocci-alist
        '((0 . 1) (1 . 1) (2 . 2) (3 . 3) (4 . 5) (5 . 8)))
#+END_SRC

In the fibanocci-alist, the CARs of each element in the list, are reference points to each respective values of the list.

If you have experience with C-like languages this is like an array.

# FIXME give a better example.
#+BEGIN_SRC C
  char string[5] = "hello";
  printf ("%d", string[3]);
#+END_SRC

#+RESULTS:
: 108

*** hash-table
A good example of a hash-table is buffer objects like =(current-buffer)=.  Lisp tells you this when you evaluate
#+BEGIN_SRC emacs-lisp :exports both
(current-buffer)
#+END_SRC

#+RESULTS:
: #<buffer elisp.org>

The syntax #<buffer buffer-name> lets you know that that buffer is a hash table.

* Lists
A list is a sequence of 0 or more elements.  You can insert or delete any of the elements in a list.

A list is made of up cons cells, which are a pair of elements.  The first is the CAR and the second is the CDR.  So

#+BEGIN_SRC emacs-lisp
'("CAR" . nil)
#+END_SRC

#+RESULTS:
| CAR |

That cons cell is a list, whose only element is the string "CAR".

In a true list, the CDR refers to the next element in the list and the last CDR in the last cons cell is the symbol 'nil'.  For example

#+BEGIN_SRC emacs-lisp
  '("This" . ("is" . ("a" . ("true" .  ("list" . nil)))))
#+END_SRC

#+RESULTS:
| This | is | a | true | list |

If the list's last CDR is not the symbol 'nil', then it is a dotted list.  Like this:

#+BEGIN_SRC emacs-lisp
'("this" . ("is" . ("a" . ("dotted" . "list"))))
#+END_SRC

#+RESULTS:
: (this is a dotted . list)

A list can also be circular, which means the last CDR refers to another item in the list.
